CREATE TABLE staff 
( 
    id INT PRIMARY KEY NOT NULL AUTO_INCREMENT, 
    name VARCHAR(45), 
    surname VARCHAR(45), 
    speciality VARCHAR(45), 
    seniority INT, 
    salary INT,
    age INT
);

INSERT staff(name, surname, speciality, seniority, salary, age) VALUES
("Вася", "Васькин","начальник",40,100000,60),
("Петя", "Петькин", "начальник", 8, 70000, 30),
("Катя", "Катькина", "инженер", 2, 70000, 25),
("Саша", "Сашкин", "инженер", 12, 50000, 35),
("Иван", "Иванов", "рабочий", 40, 30000, 59),
("Петр", "Петров", "рабочий", 20, 35000, 40),
("Сидор", "Сидоров","рабочий",10,20000,35),
("Антон", "Антонов","рабочий",8,19000,28),
("Юра", "Юркин","рабочий",5,15000,25),
("Максим", "Воронин","рабочий",2,11000,22),
("Юра", "Галкин","рабочий",3,12000,24),
("Люся", "Люськина","уборщик",10,10000,49);

SELECT * FROM staff;
